tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceFileStats savedStats{};
    const bool savedReady = ensureSavedPulseTracesReady();
    char savedCount[32]{};
    char savedSpace[48]{};
    std::snprintf(savedCount, sizeof(savedCount), "-");
    std::snprintf(savedSpace, sizeof(savedSpace), "-");
    if (savedReady) {
        savedStats = g_context.savedPulseTraces->stats();
        char savedUsed[24]{};
        char savedMax[24]{};
        std::snprintf(savedCount,
                      sizeof(savedCount),
                      "%lu / %lu 条",
                      static_cast<unsigned long>(savedStats.savedCount),
                      static_cast<unsigned long>(savedStats.maxCount));
        formatKb(savedStats.usedBytes, savedUsed, sizeof(savedUsed));
        formatKb(savedStats.maxBytes, savedMax, sizeof(savedMax));
        std::snprintf(savedSpace, sizeof(savedSpace), "%s / %s", savedUsed, savedMax);
    }
    Esp32BaseWeb::sendChunk("<section class='panel records-diagnostic-panel saved-trace-diagnostic'><div class='diagnostic-head'><h3>已保存明细</h3>"
                            "<span class='status-pill status-muted flash-badge'>Flash</span></div><div class='diagnostic-metric-grid'>");
    sendFmt("<div class='diagnostic-metric'><span>保存</span><strong>%s</strong></div>", savedCount);
    sendFmt("<div class='diagnostic-metric'><span>文件占用</span><strong>%s</strong></div>", savedSpace);
    if (savedReady) {
        sendFmt("</div><div class='diagnostic-foot'><span>单条最多 <b>%lu 点</b></span></div>",
                static_cast<unsigned long>(savedStats.sampleCapacityPerTrace));
    } else {
        Esp32BaseWeb::sendChunk("</div><div class='diagnostic-foot'><span>单条最多 <b>-</b></span></div>");
    }
    if (savedReady && savedStats.corrupt) {
        Esp32BaseWeb::sendChunk("<p class='err'>设备存储明细文件异常；不会影响启动和本次出水记录。</p>");
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void sendCalibrationParameterPanels() {
    const SystemConfig& config = *g_context.config;
    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel'><div class='panel-head'><h3>参数槽</h3>"
                            "<span class='status-pill status-ok'>固定 4 槽</span></div>"
                            "<table class='calibration-slot-table'><tr><th>槽位</th><th>名称</th><th>参数</th><th>说明</th><th>编辑</th></tr>");
    for (std::size_t i = 0; i < kMeteringSlotCount; ++i) {
        const SystemConfig::MeteringSlot& slot = config.meteringSlots[i];
        char startupVolume[24]{};
        formatLiters(slot.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
        sendFmt("<tr><td class='calibration-slot-index'>槽 %u%s</td><td class='calibration-slot-name'>",
                static_cast<unsigned>(i + 1),
                i == config.activeMeteringSlot ? "<span class='status-pill status-ok'>当前启用</span>" : "");
        sendHtmlEscapedBounded(slot.name, sizeof(slot.name));
        sendFmt("</td><td class='calibration-slot-values'><span><b>启动脉冲</b>%luP</span><span><b>启动水量</b>%s</span><span><b>稳态</b>%luP/L</span></td><td class='calibration-slot-note'>",
                static_cast<unsigned long>(slot.params.startupPulseCount),
                startupVolume,
                static_cast<unsigned long>(slot.params.stablePulsePerLiter));
        sendHtmlEscapedBounded(slot.lastModifiedNote[0] ? slot.lastModifiedNote : slot.creationNote,
                               slot.lastModifiedNote[0] ? sizeof(slot.lastModifiedNote) : sizeof(slot.creationNote));
        sendFmt("</td><td class='calibration-slot-edit'><form class='calibration-slot-form' method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                "<input type='hidden' name='action' value='update_metering_slot'>"
                "<input type='hidden' name='slot' value='%u'>"
                "<label class='compact-field slot-name-field'><span>名称</span><input name='name' maxlength='%u' value='",
                static_cast<unsigned>(i),
                static_cast<unsigned>(kMeteringSlotNameLength - 1));
        sendHtmlAttrEscapedBounded(slot.name, sizeof(slot.name));
        Esp32BaseWeb::sendChunk("'></label>");
        sendFmt("<label class='compact-field'><span>启动脉冲数</span><input name='startupPulseCount' type='number' min='0' max='%lu' step='1' value='%lu'></label>",
                static_cast<unsigned long>(kMaxSegmentedStartupPulseCount),
                static_cast<unsigned long>(slot.params.startupPulseCount));
        sendFmt("<label class='compact-field'><span>启动水量</span><input name='startupVolumeMl' type='number' min='0' max='%lu' step='1' value='%lu'></label>",
                static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl),
                static_cast<unsigned long>(slot.params.startupVolumeMl));
        sendFmt("<label class='compact-field'><span>稳态P/L</span><input name='stablePulsePerLiter' type='number' min='%lu' max='%lu' step='1' value='%lu'></label>",
                static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
                static_cast<unsigned long>(kMaxSegmentedPulsePerLiter),
                static_cast<unsigned long>(slot.params.stablePulsePerLiter));
        Esp32BaseWeb::sendChunk("<input class='secondary' type='submit' value='保存槽位'></form></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel'><div class='panel-head'><h3>候选参数</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><table class='kv'>",
            config.meteringCandidate.ready ? "status-warn" : "status-muted",
            config.meteringCandidate.ready ? "需先保存到参数槽" : "未生成");
    if (!config.meteringCandidate.ready) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td>暂无候选参数</td></tr></table></section>");
        return;
    }
    char candidateStartupVolume[24]{};
    formatLiters(config.meteringCandidate.params.startupVolumeMl, candidateStartupVolume, sizeof(candidateStartupVolume));
    sendFmt("<tr><th>启动脉冲数</th><td>%luP</td></tr>"
            "<tr><th>启动水量</th><td>%s</td></tr>"
            "<tr><th>稳态P/L</th><td>%luP/L</td></tr>"
            "<tr><th>创建说明</th><td>",
            static_cast<unsigned long>(config.meteringCandidate.params.startupPulseCount),
            candidateStartupVolume,
            static_cast<unsigned long>(config.meteringCandidate.params.stablePulsePerLiter));
    sendHtmlEscapedBounded(config.meteringCandidate.note, sizeof(config.meteringCandidate.note));
    Esp32BaseWeb::sendChunk("</td></tr></table><div class='form-actions'>");
    for (std::size_t i = 0; i < kMeteringSlotCount; ++i) {
        const bool activeSlot = i == config.activeMeteringSlot;
        sendFmt("<form method='post' action='/faucet/calibration' onsubmit=\"return confirm('%s')&&once(this)\">"
                "<input type='hidden' name='action' value='save_candidate_slot'>"
                "<input type='hidden' name='slot' value='%u'>"
                "<input class='%s' type='submit' value='%s %u'></form>",
                activeSlot ? "确认覆盖当前启用参数？保存后立即生效。" : "确认保存候选参数到该槽位？不会自动启用。",
                static_cast<unsigned>(i),
                activeSlot ? "danger" : "secondary",
                activeSlot ? "覆盖当前启用参数：槽" : "保存到槽",
                static_cast<unsigned>(i + 1));
    }
    Esp32BaseWeb::sendChunk("</div></section>");
}

void sendCalibrationFormulaPanel() {
    Esp32BaseWeb::sendChunk("<section class='panel calibration-formula-panel'><h3>参数说明与计算公式</h3>"
                            "<table class='kv'>"
                            "<tr><th>核心字段</th><td>运行时只使用启动脉冲数、启动水量、稳态P/L。</td></tr>"
                            "<tr><th>P = 0</th><td><code>估算出水量 = 0</code>。</td></tr>"
                            "<tr><th>0 &lt; P &lt;= Ns</th><td><code>估算出水量 = round(P × Vs / Ns)</code>。</td></tr>"
                            "<tr><th>P &gt; Ns</th><td><code>估算出水量 = Vs + round((P - Ns) × 1000 / Ps)</code>。</td></tr>"
                            "<tr><th>候选参数</th><td>候选生成后不会直接启用，必须先保存到参数槽；保存到非当前槽位不会自动启用。</td></tr>"
                            "<tr><th>当前槽位</th><td>保存到当前启用槽位会覆盖当前启用参数，并立即按新参数计量。</td></tr>"
                            "</table></section>");
}

