tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    Esp32BaseWeb::sendChunk("<section class='panel sample-status-panel'><h3>样本状态</h3><table class='kv'>");
    if (traceActualSynced) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>样本已入库</span></td></tr>");
    } else if (traceActualFromRecord) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>记录已校准</span></td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-muted'>待确认容量</span></td></tr>"
                                "<tr><th>下一步</th><td>请在校准页确认这条记录的实际出水量。</td></tr>");
    }
    if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>实测容量</th><td>");
        sendLitersMl(traceActualMl);
        Esp32BaseWeb::sendChunk("</td></tr>");
        Esp32BaseWeb::sendChunk(traceActualFromRecord
                                    ? "<tr><th>来源</th><td>来自确认/校准容量记录。</td></tr>"
                                    : "<tr><th>来源</th><td>来自脉冲明细样本库。</td></tr>");
    }
    if (trace->resumedAfterPause) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>暂停后恢复出水，属于多段出水，不参与启动段和分段校准拟合。</td></tr>");
    } else if (trace->truncated) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>明细已截断，不入库，不参与生成校准参数。</td></tr>");
    } else if (traceActualMl > 0 && analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>可用于拟合，稳态从第 %lu 秒开始。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>脉冲稳定，输入实测容量后可用于拟合；稳态从第 %lu 秒开始。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>实测容量已记录，但稳态识别失败，暂不能用于拟合。</td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>缺少实测容量且稳态识别失败，暂不能用于拟合。</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table><p class='hint'>确认容量统一从校准页保存；确认最后一条记录容量后会自动入库。只有已保存到设备、容量已确认且未截断的样本才参与候选参数生成。</p></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><h3>明细概况</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>"
            "<tr><th>目标</th><td>",
            startTime);
    sendTargetValue(trace->record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>固件估算</th><td>");
    sendLiters(trace->record.volumeMl);
    sendFmt("</td></tr><tr><th>有效脉冲</th><td>%lu</td></tr>"
            "<tr><th>原始边沿</th><td>%lu</td></tr>"
            "<tr><th>被过滤边沿</th><td>%lu</td></tr>"
            "<tr><th>有效率</th><td>%lu.%lu%%</td></tr>"
            "<tr><th>最高频率</th><td>有效 %lu 脉冲/%lus，原始 %lu 边沿/%lus</td></tr>"
            "<tr><th>暂停次数</th><td>%u</td></tr>"
            "<tr><th>暂停总时长</th><td>",
            static_cast<unsigned long>(effectivePulseCountValue),
            static_cast<unsigned long>(rawEdgeCount),
            static_cast<unsigned long>(filteredEdgeCount),
            static_cast<unsigned long>(effectiveRateTenths / 10U),
            static_cast<unsigned long>(effectiveRateTenths % 10U),
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(bucketSeconds),
            static_cast<unsigned long>(maxRawDelta),
            static_cast<unsigned long>(bucketSeconds),
            static_cast<unsigned>(trace->pauseWindowCount));
    sendDurationUs(pauseTotalUs);
    sendFmt("</td></tr><tr><th>暂停后恢复</th><td>%s</td></tr>"
            "<tr><th>持续时间</th><td>%lu s</td></tr>"
            "<tr><th>样本数</th><td>%lu</td></tr>"
            "<tr><th>本条占用</th><td>%s</td></tr>",
            trace->resumedAfterPause ? "是" : "否",
            static_cast<unsigned long>(trace->record.durationSec),
            static_cast<unsigned long>(trace->sampleCount),
            traceKb);
    if (analysis.stable) {
        sendFmt("<tr><th>稳态开始</th><td>第 %lu 秒，启动段 %lu 脉冲，稳态 %.2f P/s，置信度 %u%%</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<double>(analysis.stablePulsePerSec),
                static_cast<unsigned>(analysis.confidence));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>稳态识别</th><td>无法识别</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><div class='panel-head'><h3>脉冲趋势</h3><div class='row-actions trace-frequency'><span class='trace-frequency-label'>聚合频率</span>");
    constexpr std::uint32_t bucketsToShow[] = {1, 2, 3, 4, 5};
    for (std::uint32_t bucket : bucketsToShow) {
        const char* linkClass = bucket == bucketSeconds ? "btn-link page-current" : "btn-link";
        sendFmt("<a class='%s' aria-current='%s' href='%s?%s%strace=%lu&bucket=%lu'>%lus</a>",
                linkClass,
                bucket == bucketSeconds ? "true" : "false",
                detailPath,
                contextParam,
                savedSource ? "saved=1&" : "",
                static_cast<unsigned long>(traceId),
                static_cast<unsigned long>(bucket),
                static_cast<unsigned long>(bucket));
    }
    const std::uint32_t left = 54;
    const std::uint32_t top = 28;
    const std::uint32_t baseY = 224;
    const std::uint32_t chartHeight = 176;
    const std::uint32_t chartWidth = 900;
    const std::uint32_t maxEndSec =
        bucketCount == 0 ? 1 : std::max<std::uint32_t>(1, buckets[bucketCount - 1].startSec + buckets[bucketCount - 1].durationSec);
    const std::uint64_t maxChartUs = static_cast<std::uint64_t>(maxEndSec) * 1000000ULL;
    auto chartXForElapsedUs = [&](std::uint32_t elapsedUs) -> std::uint32_t {
        const std::uint64_t clamped = std::min<std::uint64_t>(elapsedUs, maxChartUs);
        return left + static_cast<std::uint32_t>((clamped * chartWidth) / std::max<std::uint64_t>(1, maxChartUs));
    };
    Esp32BaseWeb::sendChunk("</div></div><div class='pulse-detail-chart'><svg viewBox='0 0 1000 300' role='img' aria-label='脉冲明细折线图'>"
                            "<line class='axis' x1='54' y1='224' x2='954' y2='224'></line>"
                            "<line class='axis' x1='54' y1='28' x2='54' y2='224'></line>"
                            "<line class='axis' x1='954' y1='28' x2='954' y2='224'></line>");
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        const std::uint32_t endUs =
            window.endElapsedUs > window.startElapsedUs ? window.endElapsedUs : static_cast<std::uint32_t>(std::min<std::uint64_t>(maxChartUs, UINT32_MAX));
        const std::uint32_t x1 = chartXForElapsedUs(window.startElapsedUs);
        std::uint32_t x2 = chartXForElapsedUs(endUs);
        if (x2 <= x1) {
            x2 = x1 + 1U;
        }
        sendFmt("<rect class='pause-window' x='%lu' y='%lu' width='%lu' height='%lu'><title>暂停区间 %lu.%03lu s - %lu.%03lu s</title></rect>"
                "<line class='pause-boundary' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<line class='pause-boundary' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x2 - x1),
                static_cast<unsigned long>(baseY - top),
                static_cast<unsigned long>(window.startElapsedUs / 1000000UL),
                static_cast<unsigned long>((window.startElapsedUs % 1000000UL) / 1000UL),
                static_cast<unsigned long>(endUs / 1000000UL),
                static_cast<unsigned long>((endUs % 1000000UL) / 1000UL),
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(x2),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x2),
                static_cast<unsigned long>(baseY));
    }
    for (std::uint32_t i = 1; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        sendFmt("<line class='grid-line' x1='54' y1='%lu' x2='954' y2='%lu'></line>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxDelta * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-y-label' x='48' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxRawDelta * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-raw-y-label' x='960' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t x = left + (chartWidth * i) / 4;
        const std::uint32_t value = (maxEndSec * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-x-label' x='%lu' y='248'>%lus</text>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(value));
    }
    sendFmt("<text class='chart-label' x='58' y='20'>有效最高 %lu 脉冲 / 原始最高 %lu 边沿</text>",
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(maxRawDelta));
    bool prevRawValid = false;
    std::uint32_t prevRawX = left;
    std::uint32_t prevRawY = baseY;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = buckets[i].rawEdgeDelta;
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxRawDelta;
        const std::uint32_t lineStartX = prevRawValid ? prevRawX : startX;
        const std::uint32_t lineStartY = prevRawValid ? prevRawY : baseY;
        sendFmt("<line class='raw-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(lineStartX),
                static_cast<unsigned long>(lineStartY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
        prevRawValid = true;
        prevRawX = x;
        prevRawY = y;
    }
    bool prevPulseValid = false;
    std::uint32_t prevPulseX = left;
    std::uint32_t prevPulseY = baseY;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        const std::uint32_t lineStartX = prevPulseValid ? prevPulseX : startX;
        const std::uint32_t lineStartY = prevPulseValid ? prevPulseY : baseY;
        sendFmt("<line class='pulse-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(lineStartX),
                static_cast<unsigned long>(lineStartY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
        prevPulseValid = true;
        prevPulseX = x;
        prevPulseY = y;
    }
    if (analysis.stable) {
        const std::uint32_t stableX = left + (analysis.stableStartSec * chartWidth) / maxEndSec;
        sendFmt("<line class='stable-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<text class='chart-label' x='%lu' y='42'>稳态 %lus</text>",
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(stableX + 6),
                static_cast<unsigned long>(analysis.stableStartSec));
    }
    std::uint32_t effectiveCumulative = 0;
    std::uint32_t rawCumulative = 0;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t rawDelta = buckets[i].rawEdgeDelta;
        effectiveCumulative += chartDelta;
        rawCumulative += rawDelta;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        const std::uint32_t rawY = baseY - (rawDelta * chartHeight) / maxRawDelta;
        sendFmt("<circle class='raw-dot' cx='%lu' cy='%lu' r='2.1'><title>第%lu秒: 原始边沿 %lu / 原始累计 %lu</title></circle>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(rawY),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(rawDelta),
                static_cast<unsigned long>(rawCumulative));
        sendFmt("<circle class='pulse-dot' cx='%lu' cy='%lu' r='2.8'><title>第%lu秒: 有效脉冲 %lu / 有效累计 %lu / %s</title></circle>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(chartDelta),
                static_cast<unsigned long>(effectiveCumulative),
                traceStateText(buckets[i].state));
    }
    Esp32BaseWeb::sendChunk("</svg></div><div class='chart-legend'>"
                            "<span><i class='legend-mark legend-pulse'></i>有效脉冲</span>"
                            "<span><i class='legend-mark legend-raw'></i>原始边沿</span>"
                            "<span><i class='legend-mark legend-paused'></i>暂停区间</span>"
                            "<span><i class='legend-mark legend-stable'></i>稳态开始</span>"
                            "</div></section>");
    const char* rawSavedParam = savedSource ? "saved=1&" : "";
    const std::size_t rawPreviewCount = rawTracePreviewSampleCount(*trace);
    Esp32BaseWeb::sendChunk("<section class='panel detail-data'><div class='panel-head'><h3>原始明细</h3><div class='row-actions'>");
    sendFmt("<a class='btn-link' target='_blank' rel='noopener' href='%s?raw=1&%s%strace=%lu'>显示原始明细</a>",
            detailPath,
            contextParam,
            rawSavedParam,
            static_cast<unsigned long>(traceId));
    if (trace->sampleCount > rawPreviewCount) {
        sendFmt("<a class='btn-link' target='_blank' rel='noopener' href='%s?raw=1&%s%strace=%lu&all=1'>显示所有明细</a>",
                detailPath,
                contextParam,
                rawSavedParam,
                static_cast<unsigned long>(traceId));
    }
    sendFmt("</div></div><p class='hint'>默认展示前 %lu 个原始边沿；原始边沿共 %lu 个，当前展示 %lu 个。</p>"
            "<table class='raw-trace-table'><tr><th>序号</th><th>距开始</th><th>与上一边沿间隔</th><th>有效累计</th></tr>",
            static_cast<unsigned long>(kRawTracePreviewLastSecond),
            static_cast<unsigned long>(trace->sampleCount),
            static_cast<unsigned long>(rawPreviewCount));
    std::uint32_t rawPreviewEffective = 0;
    std::uint32_t lastEffectiveElapsedUs = 0;
    for (std::size_t i = 0; i < rawPreviewCount; ++i) {
        const std::uint32_t intervalUs = i == 0 ? 0 : samples[i].elapsedUs - samples[i - 1].elapsedUs;
        bool effective = i == 0;
        if (i > 0 && samples[i].elapsedUs >= lastEffectiveElapsedUs &&
            samples[i].elapsedUs - lastEffectiveElapsedUs >= trace->pulseMinIntervalUs) {
            effective = true;
        }
        if (effective) {
            ++rawPreviewEffective;
            lastEffectiveElapsedUs = samples[i].elapsedUs;
        }
        sendFmt("<tr><td>%lu</td><td>", static_cast<unsigned long>(i));
        sendDurationUs(samples[i].elapsedUs);
        Esp32BaseWeb::sendChunk("</td><td>");
        sendDurationUs(intervalUs);
        sendFmt("</td><td>%lu</td></tr>", static_cast<unsigned long>(rawPreviewEffective));
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    delete[] samples;
    delete[] buckets;
    sendPageEnd();
}

